test/autocannon-stress.txt
> api-marvel@0.0.1 test:cannon
> npx autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000/comics/1/characters

Running 2s warmup @ http://localhost:3000/comics/1/characters
1 connections
10 workers

Running 20s test @ http://localhost:3000/comics/1/characters
500 connections
10 workers

/
┌─────────┬────────┬────────┬─────────┬─────────┬───────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%     │ Avg       │ Stdev      │ Max      │
├─────────┼────────┼────────┼─────────┼─────────┼───────────┼────────────┼──────────┤
│ Latency │ 334 ms │ 509 ms │ 4148 ms │ 6139 ms │ 992.82 ms │ 1248.97 ms │ 14362 ms │
└─────────┴────────┴────────┴─────────┴─────────┴───────────┴────────────┴──────────┘
┌───────────┬─────────┬─────────┬────────┬─────────┬──────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%    │ 97.5%   │ Avg      │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼────────┼─────────┼──────────┼────────┼─────────┤
│ Req/Sec   │ 656     │ 656     │ 1.064  │ 1.155   │ 1.037,91 │ 113,04 │ 656     │
├───────────┼─────────┼─────────┼────────┼─────────┼──────────┼────────┼─────────┤
│ Bytes/Sec │ 2.03 MB │ 2.03 MB │ 3.3 MB │ 3.58 MB │ 3.22 MB  │ 350 kB │ 2.03 MB │
└───────────┴─────────┴─────────┴────────┴─────────┴──────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 20758 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 120          │
├────────────┼──────────────┤
│ 0.01       │ 206          │
├────────────┼──────────────┤
│ 0.1        │ 290          │
├────────────┼──────────────┤
│ 1          │ 318          │
├────────────┼──────────────┤
│ 2.5        │ 334          │
├────────────┼──────────────┤
│ 10         │ 392          │
├────────────┼──────────────┤
│ 25         │ 454          │
├────────────┼──────────────┤
│ 50         │ 509          │
├────────────┼──────────────┤
│ 75         │ 919          │
├────────────┼──────────────┤
│ 90         │ 2237         │
├────────────┼──────────────┤
│ 97.5       │ 4148         │
├────────────┼──────────────┤
│ 99         │ 6139         │
├────────────┼──────────────┤
│ 99.9       │ 11086        │
├────────────┼──────────────┤
│ 99.99      │ 14138        │
├────────────┼──────────────┤
│ 99.999     │ 14362        │
└────────────┴──────────────┘

22k requests in 20.14s, 64.3 MB read
610 errors (0 timeouts)